test/goldens/graph-to-dot/graph_test_06.dot
digraph unix {
  graph [ dpi = 72 ]; 
  graph [nodesep = 0.25; ranksep=0.25];
  fontname="Arial"
  node [fontname="Arial"]
  edge [fontname="Arial"]
  subgraph cluster_level3_67 {
    label = "level3"; // scope
    s111_123 [
      label = "s111"; // node
    ];
    c111_137 [
      label = "c111"; // node
      style = filled;
      fillcolor = "#FFFFAA";
    ];
    subgraph cluster_level2_68 {
      label = "level2"; // scope
      s11_124 [
        label = "s11"; // node
      ];
      s10_125 [
        label = "s10"; // node
      ];
      s01_126 [
        label = "s01"; // node
        style = filled;
        fillcolor = "#FFFFAA";
      ];
      s00_127 [
        label = "s00"; // node
      ];
      c00_133 [
        label = "c00"; // node
      ];
      c01_134 [
        label = "c01"; // node
      ];
      c10_135 [
        label = "c10"; // node
      ];
      c11_136 [
        label = "c11"; // node
      ];
      subgraph cluster_level1_69 {
        label = "level1"; // scope
        s1_128 [
          label = "s1"; // node
        ];
        s0_129 [
          label = "s0"; // node
        ];
        c0_131 [
          label = "c0"; // node
        ];
        c1_132 [
          label = "c1"; // node
          style = filled;
          fillcolor = "#FFFFAA";
        ];
        subgraph cluster_level0_70 {
          label = "level0"; // scope
          x_130 [
            label = "x"; // node
          ];
          
        }
        
      }
      
    }
    
  }
  "s111_123" -> "s11_124";
  "s11_124" -> "s1_128";
  "s10_125" -> "s1_128";
  "s01_126" -> "s0_129";
  "s00_127" -> "s0_129";
  "c11_136" -> "c111_137";
  "s1_128" -> "x_130";
  "s0_129" -> "x_130";
  "c0_131" -> "c00_133";
  "c0_131" -> "c01_134";
  "c1_132" -> "c10_135";
  "c1_132" -> "c11_136";
  "x_130" -> "c0_131";
  "x_130" -> "c1_132";
}
